import re 

def Lemmatization(text): 
    word_lemmatization = {
        r'รมว\.กต\.?': 'รัฐมนตรีว่าการกระทรวงการต่างประเทศของไทย',
        r'รมว\.กต': 'รัฐมนตรีว่าการกระทรวงการต่างประเทศของไทย',

        r'กก\.บห\.?': 'คณะกรรมการบริหาร',
        r'กกบห\.': 'คณะกรรมการบริหาร',

        r'ผบ\.สส\.?': 'ผู้บัญชาการทหารสูงสุด',
        r'ผบสส\.': 'ผู้บัญชาการทหารสูงสุด',

        r'ส\.ป\.ส\.ช\.?': 'สำนักงานหลักประกันสุขภาพแห่งชาติ',
        r'สปสช\.': 'สำนักงานหลักประกันสุขภาพแห่งชาติ',

        r'ก\.ส\.ท\.ช\.?': 'คณะกรรมการกิจการกระจายเสียงกิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ',
        r'กสทช\.': 'คณะกรรมการกิจการกระจายเสียงกิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ',

        r'ร\.ม\.ว\.?': 'รัฐมนตรีว่าการ',
        r'รมว\.': 'รัฐมนตรีว่าการ',

        r'ส\.ค\.ร\.?': 'สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ',
        r'สคร\.': 'สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ',

        r'ค\.ร\.ม\.?': 'คณะรัฐมนตรี',
        r'ครม\.': 'คณะรัฐมนตรี',

        r'ก\.ล\.ต\.?': 'สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์',
        r'กลต\.': 'สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์',
        
        r'ส\.ม\.ช\.?': 'สำนักงานสภาความมั่นคงแห่งชาติ',
        r'สมช\.': 'สำนักงานสภาความมั่นคงแห่งชาติ',

        r'น\.ร\.ต\.?': 'นักเรียนนายร้อยตำรวจ',
        r'นรต\.': 'นักเรียนนายร้อยตำรวจ',

        r'ส\.ส\.ส\.?': 'สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ',
        r'สสส\.': 'สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ',

        r'ผ\.บ\.ช\.': 'ผู้บัญชาการ',
        r'ผบช\.': 'ผู้บัญชาการ',

        r'ก\.อ\.ช\.?': 'กองทุนการออมแห่งชาติ',
        r'กอช\.': 'กองทุนการออมแห่งชาติ',

        r'ส\.ป\.ป\.?': 'สาธารณรัฐประชาธิปไตยประชาชน',
        r'สปป\.': 'สาธารณรัฐประชาธิปไตยประชาชน',

        r'ก\.ส\.ร\.?': 'กรมสวัสดิการและคุ้มครองแรงงาน',
        r'กสร\.': 'กรมสวัสดิการและคุ้มครองแรงงาน',

        r'ก\.ท\.ม\.?': 'กรุงเทพมหานคร',
        r'กทม\.': 'กรุงเทพมหานคร',

        r'ก\.ก\.ต\.?': 'คณะกรรมการการเลือกตั้ง',
        r'กกต\.': 'คณะกรรมการการเลือกตั้ง',

        r'อ\.บ\.จ\.?': 'องค์การบริหารส่วนจังหวัด',
        r'อบจ\.': 'องค์การบริหารส่วนจังหวัด',

        r'พ\.ร\.บ\.?': 'พระราชบัญญัติ',
        r'พรบ\.': 'พระราชบัญญัติ',

        r'ผ\.ก\.ก\.?': 'ผู้กำกับการ',
        r'ผกก\.': 'ผู้กำกับการ',

        r'ก\.ก\.ร\.?': 'คณะกรรมการร่วมภาคเอกชน3สถาบัน',
        r'กกร\.': 'คณะกรรมการร่วมภาคเอกชน3สถาบัน',

        r'ก\.ล\.ต\.?': 'สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์',
        r'กลต\.': 'สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์',

        r'ส\.พ\.ฐ\.?': 'สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน',
        r'สพฐ\.': 'สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน',

        r'ม\.ท\.ร\.?': 'มหาวิทยาลัยเทคโนโลยีราชมงคล',
        r'มทร\.': 'มหาวิทยาลัยเทคโนโลยีราชมงคล',

        r'จ\.น\.ท\.?': 'เจ้าหน้าที่',
        r'จนท\.': 'เจ้าหน้าที่',

        r'ป\.ป\.ง\.?': 'สำนักงานป้องกันและปราบปรามการฟอกเงิน',
        r'ปปง\.': 'สำนักงานป้องกันและปราบปรามการฟอกเงิน',

        r'ธ\.ก\.ส\.?': 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร',
        r'ธกส\.': 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร',

        r'ส\.ป\.ส\.?': 'สำนักงานประกันสังคม',
        r'สปส\.': 'สำนักงานประกันสังคม',

        r'พ\.น\.ง\.?': 'พนักงาน',
        r'พนง\.': 'พนักงาน',

        r'ก\.ส\.ท\.?': 'การสื่อสารแห่งประเทศไทย',
        r'กสท\.': 'การสื่อสารแห่งประเทศไทย',

        r'ก\.ฟ\.ภ\.?': 'การไฟฟ้าส่วนภูมิภาค',
        r'กฟภ\.': 'การไฟฟ้าส่วนภูมิภาค',

        r'ร\.ฟ\.ม\.?': 'การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย',
        r'รฟม\.': 'การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย',

        r'ป\.ช\.ช\.?': 'ประชาชน',
        r'ปชช\.': 'ประชาชน',

        r'ต\.ก\.?': 'กองแผนงานกิจการพิเศษ',
        r'ตก\.': 'กองแผนงานกิจการพิเศษ',

        r'พ\.ม\.?': 'กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์',
        r'พม\.': 'กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์',
        
        r'ก\.ม\.?': 'กฎหมาย',
        r'กม\.': 'กฎหมาย',

        r'ม\.ท\.?': 'กระทรวงมหาดไทย',
        r'มท\.': 'กระทรวงมหาดไทย',

        r'ต\.ม\.?': 'กองตรวจคนเข้าเมือง',
        r'ตม\.': 'กองตรวจคนเข้าเมือง',

        r'ส\.ธ\.?': 'กระทรวงสาธารณสุข',
        r'สธ\.': 'กระทรวงสาธารณสุข',

        r'อ\.ย\.?': 'สํานักงานคณะกรรมการอาหารและยา',
        r'อย\.': 'สํานักงานคณะกรรมการอาหารและยา',

        r'ผ\.อ\.?': 'ผู้อำนวยการ',
        r'ผอ\.': 'ผู้อำนวยการ',

        r'ผ\.ก\.?': 'กองแผนงานกิจการพิเศษ',
        r'ผก\.': 'กองแผนงานกิจการพิเศษ',

        r'ร\.พ\.?': 'โรงพยาบาล',
        r'รพ\.': 'โรงพยาบาล',

        r'ส\.ภ\.?': 'สถานีตำรวจภูธร',
        r'สภ\.': 'สถานีตำรวจภูธร',

        r'น\.ร\.?': 'นักเรียน',
        r'นร\.': 'นักเรียน',
        
        r'ร\.ร\.?': 'โรงเรียน',
        r'รร\.': 'โรงเรียน',

        r'ท\.ส\.?': 'กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม',
        r'ทส\.': 'กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม',

        r'น\.ช\.?': 'นักโทษชาย',
        r'นช\.': 'นักโทษชาย',

        r'ศ\.ธ\.?': 'กระทรวงศึกษาธิการ',
        r'ศธ\.': 'กระทรวงศึกษาธิการ',

        r'ผ\.บ\.?': 'ผู้บัญชาการ',
        r'ผบ\.': 'ผู้บัญชาการ',

        r'ล\.บ\.?': 'ล้านบาท',
        r'ลบ\.': 'ล้านบาท',

        r'ม\.ค\.?': 'มกราคม', 
        r'มค\.': 'มกราคม',

        r'ก\.พ\.?': 'กุมภาพันธ์',
        r'กพ\.': 'กุมภาพันธ์',

        r'มี\.ค\.?': 'มีนาคม',
        r'มีค\.': 'มีนาคม',

        r'เม\.ย\.?': 'เมษายน',
        r'เมย\.': 'เมษายน',

        r'พ\.ค\.?': 'พฤษภาคม',
        r'พค\.': 'พฤษภาคม',

        r'มิ\.ย\.?': 'มิถุนายน',
        r'มิย\.': 'มิถุนายน',

        r'ก\.ค\.?': 'กรกฎาคม',
        r'กค\.': 'กรกฎาคม',

        r'ส\.ค\.?': 'สิงหาคม',
        r'สค\.': 'สิงหาคม',

        r'ก\.ย\.?': 'กันยายน',
        r'กย\.': 'กันยายน',

        r'ต\.ค\.?': 'ตุลาคม',
        r'ตค\.': 'ตุลาคม',

        r'พ\.ย\.?': 'พฤศจิกายน',
        r'พย\.': 'พฤศจิกายน',

        r'ธ\.ค\.?': 'ธันวาคม',
        r'ธค\.': 'ธันวาคม',

        r'ม\.33': 'มาตรา33',
        r'ม\.39': 'มาตรา39',
        r'ม\.40': 'มาตรา40',
        r'ม\.112': 'มาตรา112',
    }

    for pattern, full_text in word_lemmatization.items():
        text = re.sub(pattern, full_text, text)

    return text
